In [1]:
import sqlalchemy

print(sqlalchemy.__version__)

1.4.45

# With Pandas

In [9]:
from sqlalchemy import create_engine, select, MetaData, Table, func
import pandas as pd

In [3]:
engine = create_engine("sqlite:///data/census.sqlite")

In [4]:
# Criando uma conexão com o banco para executar comandos
connection = engine.connect()

In [5]:
metadata = MetaData()
census = Table('census', metadata, autoload=True, autoload_with=engine)

In [7]:
census.columns.items()

[('state', Column('state', VARCHAR(length=30), table=<census>)),
 ('sex', Column('sex', VARCHAR(length=1), table=<census>)),
 ('age', Column('age', INTEGER(), table=<census>)),
 ('pop2000', Column('pop2000', INTEGER(), table=<census>)),
 ('pop2008', Column('pop2008', INTEGER(), table=<census>))]

In [12]:
# População de 2008 agrupada por estado
statement = select([census.columns.state, func.sum(census.columns.pop2008)])
statement = statement.group_by(census.columns.state)
results = connection.execute(statement).fetchall()
results[:5]

[('Alabama', 9298734),
 ('Alaska', 1329092),
 ('Arizona', 12961534),
 ('Arkansas', 5696864),
 ('California', 73218004)]

In [13]:
# Armazendo os resultados de um select em um dataframe
df = pd.DataFrame(results)
df.columns = results[0].keys()
df.head()

        state     sum_1
0     Alabama   9298734
1      Alaska   1329092
2     Arizona  12961534
3    Arkansas   5696864
4  California  73218004